---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FabricAreaFailures.FabricAreaOutSideOfHost
source: html/4f206339-8497-4271-a697-e79ca96b7650.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FabricAreaFailures.FabricAreaOutSideOfHost Property

Fabric Area is sketched completely outside of its host.

## Syntax (C#)
```csharp
public static FailureDefinitionId FabricAreaOutSideOfHost { get; }
```